stresstests/artillery.yaml
config:
  target: "http://127.0.0.1:3000/reviews"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 300
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Get Reviews"
    flow:
      - get:
          url: "/62/meta"